words = {"home-1-h":"Davidd Worley","home-2-h":"For Pocatello Mayor","home-3-h":"Freedom For a Change","home-4-p":"\"As mayor of Pocatello, I will return the focus of government to serving the citizens, not dictating to them.\"","home-5-p":"David believes it is essential that the chief executive of the city acts to protect the rights of the individual citizen.<br>","home-6-h":"Click to learn more about David's platform.<br>","home-7-h":"want to make a difference?","home-8-h":"Join Us","home-9-h":"Donate","home-10-h":"Help the cause.","home-11-h":"Copyright WorleyForIdaho.com","vision-1-h":"Visions","vision-2-p":"The principles of the American Founding are applicable at every level of government, including local government. The central idea of American government is found in the Declaration of Independence:<br><br>“We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. — That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed…”<br><br>Our rights come from God and the central purpose of government is to protect those rights. Every just power that government has to accomplish this purpose comes from the consent of the people.<br><br>As mayor of Pocatello, I will restore the ideals of the American Founding to their proper place as the guiding principles of our city government.","vision-3-h":"Copyright WorleyForIdaho.com","platform-1-h":"Platform","platform-2-h":"Transparency and Accountability","platform-3-p":"All government officers, elected and unelected, can justly govern only by the consent of the governed. In a Republic, the people choose their leaders at the ballot box, but also have a fundamental right to be involved in what their government does throughout an elected leader’s term of office.<br><br>City Hall belongs to the people. Time and space for public comment must be expanded and COVID-19 must not be used as an excuse to shut the people out. As your mayor I will ensure your voice is heard and I will fight for you in your city government.<br><br>As mayor I will task city officials with generating clear and concise reports that make it easy for the common citizen to see how and where their hard-earned tax dollars are being spent. I will also clearly identify whom city spending and policies benefit and whom they hurt. The citizens of Pocatello have a right to know how city policy actually impacts their community.<br><br>As your mayor I will serve the city as a whole, not the narrow interests of the few with power and influence.","platform-4-h":"Less Spending, Lower Taxes","platform-5-p":"Ronald Reagan once observed “As government expands, liberty contracts.” Every dollar the city spends is a dollar it had to take from the people. Every dollar taken reduces the freedom that citizens have to determine for themselves how to spend their wages. The people of Pocatello deserve a city government that spends their money wisely and efficiently, and takes as little as possible.<br><br>Under the current administration, the city budget has expanded every year and is now far beyond what our city’s tax base can support. Every year for the past twelve years city taxes have gone up. The median household income of Pocatello is the lowest in Southeast Idaho, but we pay the most in property taxes per citizen. Taxing and spending must come down.<br><br>Getting the budget under control to reduce spending and lower taxes will require courage and leadership. Avoiding tough choices for years is why we have budget deficits and are burning through the city’s cash reserves. Reducing city spending can be accomplished by making the city more efficient and right-sizing the workforce through natural attrition. However, it will also require a hard look at the size and scope of city government.<br><br>As mayor I will lead the effort to reduce spending and lower our taxes. I will not kick the can down the road. If we do not make tough choices now, we will only have bad options later. I will lead with courage and do what is necessary.","platform-6-h":"More Freedom","platform-7-p":"The central purpose of government is to protect the rights of the people. As mayor I will never impose lockdowns. Every job and business is essential, because every job puts food on someone’s table. No more mandates or pressure to wear masks or get vaccines. We should be allowed to make our own private medical decisions without force or intimidation.<br><br>A forgotten principle of our nation’s founding is that government officers have a right and a duty to protect the people they serve from the tyranny of a higher level of government. I will restore this principle to our city. I will never use the power of the police or any other city resource to impose an immoral or unconstitutional law or executive order from the state or federal government.<br><br>The Republic must be restored, one city, county, and state at a time. Let’s do our part here in Pocatello.","platform-8-h":"Copyright WorleyForIdaho.com","about-1-h":"Who is David Worley?","about-2-p":"David Worley was born and raised in Pocatello, Idaho, and is a proud Pocatello Indian alum. David earned a Bachelor’s degree in Government and International Politics from George Mason University, Virginia. He also has a Master of Arts in Statecraft and National Security Affairs from the Institute of World Politics, Washington D.C.","about-3-p":"David Worley is a commissioned infantry officer in the Army National Guard with nineteen years of public service as a member of the armed forces, including twelve years of active duty. He is a combat veteran and has deployed three times to the Middle East, including two tours to Iraq.<br><br>Last year he was activated to serve as the Operations Officer for the Virginia National Guard state task force to defend the lives and property of Virginians from Antifa and BLM radicals during the 2020 Richmond Riots.","about-4-p":"In addition to his military service David has always been involved in his church and community. David Worley’s wife Barbara is also a Pocatello Indian alum and was born and raised in Chubbuck. They have five children and are eager to serve the citizens of Pocatello.","about-5-h":"Copyright WorleyForIdaho.com","events-1-h":"2022 Events","events-2-h":"Join us!","events-3-h":"Past Events","events-4-h":"Host an Event","events-5-p":"Want to host an event? We'd love it if you would!<br>‍<br>For scheduling call: (208) 701-2442","events-6-h":"Copyright WorleyForIdaho.com","media-1-h":"media","media-2-h":"Copyright WorleyForIdaho.com","donate-1-h":"donate","donate-2-h":"Make a campaign contribution","donate-3-h":"Donate via credit card:","donate-4-h":"Contribute via Venmo:","donate-5-h":"@DW-for-Mayor","donate-6-p":"Please include your address with your Venmo contribution, or email it to the campaign staff. We want to properly attribute your contribution, as well as send receipts and thanks.","donate-7-h":"Contact us at WorleyCampaign@protonmail.com for more ways to donate.","donate-8-h":"Copyright WorleyForIdaho.com","contact-1-h":"Contact Us","contact-2-h":"We'd love to hear from you","contact-3-h":"(208)701-2442 ","contact-4-h":"WorleyCampaign@protonmail.com","contact-5-h":"Facebook Page","contact-6-h":"Copyright WorleyForIdaho.com","events":[{"title":"hi","details":"an event is coming","place":"a building","date":"Feb 11","time":"7pm","past":"false"},{"title":"hello past","details":"an event is coming","place":"a building","date":"Feb 12","time":"8pm","past":"true"},{"title":"hello","details":"an event is coming","place":"a building","date":"Feb 12","time":"8pm","past":"false"}]}
