words = {"home-1-h":"David Worley","home-2-h":"For State Senate","home-3-h":"Restore the Republic","home-4-p":"&#x22;The purpose of government is to protect the God-given rights of the people. If Idaho is to remain free, we must fight now.&#x22;","home-7-h":"want to make a difference?","home-8-h":"Join Us","home-9-h":"Donate","home-10-h":"Help the cause.","home-11-h":"Copyright WorleyForIdaho.com","vision-1-h":"Vision","vision-2-p":"It has become clear to a growing number of Americans that our nation is in the middle of an existential conflict between two incompatible worldviews and systems of political thought. However, this divide is much more than a &#x22;Left vs. Right&#x22; or partisan division; it is a division between those who want freedom and those who want total control.<br><br>The fight over Critical Race Theory (CRT) and critical gender theory exposed that<br><br>Leftist radicals now dominate the Democrat Party. These radicals fight for Marxist doctrines that are every bit as dangerous to the Republic as communism was during the Cold War. This new iteration of Marxism, Woke Communism, is the totalitarian political heresy of our age. Those who embrace Woke Communism cannot be reasoned with or appeased, like the Soviets of the last century; they must be defeated.<br><br><b>My vision is simple: we win, they lose.</b> There is no moral obligation to tolerate evil. I will directly confront this totalitarian ideology and its supporters.<br><br>God created us male and female, period. The mental and physical mutilation of boys and girls in the name of &#x22;transgenderism&#x22; is evil and must be stopped. Likewise, the propagation of sexual immorality in our schools also must be stopped.<br><br>In all its manifestations, Critical Race Theory is nothing more than a re-packaging of Marxism. It exploits and stokes race division to accomplish the same goals traditional Marxism sought through class division. This manifestation of Woke Communism is ideological poison and must be driven from our schools and universities.<br><br>If elected, I will use every power of my office and the platform it provides to expose, confront, and defeat Woke Communism in Idaho.<br><br>The time for half measures has passed. <b>It is time to Restore the Republic.</b><br><br>We must restore the Founding Fathers&#x27; ideals to their rightful place as the guiding principles of American government. This begins with reasserting the premise of the American Revolution found in the Declaration of Independence:<br><br>&#x22;We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. - That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed....&#x22;<br><br>Our rights come from God, and the central purpose of government is to protect those rights. Every just power government has to accomplish this purpose comes from the consent of the people.<br><br>As your State Senator, I will fight to restore the ideals of the American Founding to their proper place as the guiding principles of our state government","vision-3-h":"Copyright WorleyForIdaho.com","platform-1-h":"Platform","platform-9-p":"&#x22;The purpose of government is to protect the <b>God-given rights</b> of the people. As a state, we must act to defend our freedom against Federal and corporate tyranny. If Idaho is to remain free, <b>we must fight now.</b>&#x22;","platform-2-h":"State Sovereignty","platform-3-p":"<b>No more bending the knee</b> to unconstitutional Federal mandates. The people of Idaho need a government that will protect them from Federal overreach. Other states, such as Florida, have shown us that states can resist the Federal government and protect the freedom of their people using state law.<br><br>According to the Founder&#x27;s original design, the state should be the unit of government with the strongest domestic powers. It is time to reassert the sovereignty of our state and establish Idaho as a free state - a state free from government and corporate tyranny. Idaho must be a state where the Bill of Rights is in full effect, regardless of what goes on in Washington DC or corporate board rooms.","platform-4-h":"School Choice","platform-5-p":"Our schools no longer promote the civic virtue necessary to sustain a free state and a just society. We need school choice so <b>families can choose</b> schools that reflect their values.<br><br>Ronald Reagan once warned that &#x201C;Freedom is never more than one generation from extinction.&#x201D; The ideals of the American Revolution must be passed from generation to generation for the Republic to survive. Schools are the primary means by which ideas are passed from one generation to the next.<br><br>We cannot allow another generation of Americans to be educated in a system that neglects or attacks our nation&#x27;s heritage. It is time to break the government education monopoly so that we can begin raising up a generation of citizens who know their history, love their country, and understand the principles of freedom.","platform-6-h":"Medical Freedom","platform-7-p":"The right to control what goes into your body is non-negotiable. We need a Medical Bill of Rights in Idaho. People, with their doctors, make decisions - not bureaucrats and corporations. <b>No vaccine mandates</b>, public or private sector.<br><br>Across the country, people are being denied lifesaving medical treatment, such as organ transplants, for refusing the COVID shot. Hundreds of thousands of Americans were denied lifesaving early treatment throughout the pandemic. This is still happening today.<br><br>The right to bodily autonomy is a God-given right. However, the pandemic showed us that it must be enshrined in Idaho law to ensure that people can get the medical care they need and refuse unwanted treatment. We must also ensure that doctors can practice medicine without fear of persecution.","platform-10-h":"Economic Freedom","platform-11-p":"No more unconstitutional lockdowns. <b>Every business is essential</b> because every job puts food on someone&#x27;s table. No vaccine passport or anything that resembles a &#x22;social credit system.&#x22;<br><br>Many of the oppressive pandemic mandates have ended. However, the power seized and the precedent set by government and big business must be rolled back. Many large corporations are still trying to impose vaccine mandates on their employees. The ruling class is trying to keep as much of the power they seized during the pandemic as possible.<br><br>We need state laws that limit the power of governor rule by executive fiat during an emergency. We need laws that ensure that businesses do not have to live in fear of future shutdowns during the next &#x201C;crisis.&#x201D;<br><br>We also need laws that protect Idaho against future threats. No one should lose their job, their ability to get a loan, or their ability to use a bank due to their religious or political beliefs. The tyranny emerging in our country, Canada, and the Western world must not be allowed to come to Idaho.","platform-8-h":"Copyright WorleyForIdaho.com","about-1-h":"Who is David Worley?","about-2-p":"David Worley was born and raised in Pocatello, Idaho, and is a proud Pocatello Indian alum. David earned a Bachelor&#x27;s degree in Government and International Politics from George Mason University, Virginia. He also has a Master of Arts in Statecraft and National Security Affairs from the Institute of World Politics, Washington D.C.","about-3-p":"David Worley is a commissioned infantry officer in the Army National Guard with nineteen years of public service as a member of the armed forces, including twelve years of active duty. He is a combat veteran and has deployed three times to the Middle East, including two tours to Iraq.<br><br>Last year he was activated to serve as the Operations Officer for the Virginia National Guard state task force to defend the lives and property of Virginians from Antifa and BLM radicals during the 2020 Richmond Riots.","about-4-p":"In addition to his military service David has always been involved in his church and community. David Worley&#x27;s wife Barbara is also a Pocatello Indian alum and was born and raised in Chubbuck. They have five children and are eager to serve the citizens of Pocatello.","about-5-h":"Copyright WorleyForIdaho.com","events-1-h":"2022 Events","events-2-h":"Join us!","events-3-h":"Past Events","events-4-h":"Host an Event","events-5-p":"Want to host an event? We&#x27;d love it if you would!<br><br>For scheduling call: (208) 701-2442","events-6-h":"Copyright WorleyForIdaho.com","media-1-h":"media","media-2-h":"Copyright WorleyForIdaho.com","donate-1-h":"donate","donate-2-h":"Make a campaign contribution","donate-3-h":"Donate via credit card:","donate-4-h":"Contribute via Venmo:","donate-5-h":"@WorleyforIdaho","donate-6-p":"Please include your address with your Venmo contribution, or email it to the campaign staff. We want to properly attribute your contribution, as well as send receipts and thanks.","donate-7-h":"Contact us at WorleyCampaign@protonmail.com for more ways to donate.","donate-8-h":"Copyright WorleyForIdaho.com","contact-1-h":"Contact Us","contact-2-h":"We&#x27;d love to hear from you","contact-3-h":"(208)701-2442 ","contact-4-h":"WorleyCampaign@protonmail.com","contact-5-h":"Facebook Page","contact-6-h":"Copyright WorleyForIdaho.com","events":[{"title":"Idaho Senate Campaign Kickoff","details":"Members of our community are invited to join us to officially launch David Worley&#x27;s campaign for Idaho State Senate, District 29. Attendees will get to hear David introduce himself, speak about his principles and issues that are important to our community and state, as well as learn how to help him get elected.","place":"Bannock County Veterans Memorial Building","date":"Feb 21","time":"7pm","past":"undefined"}],"media":[{"title":"Steve Lucas","code":"<a href=&#x22;http://www.kidnewsradio.com/featured-interview-david-worley-candidate-for-pocatello-mayor/?fbclid=IwAR2ReDzsW6xEmosBwGK1t6eSE0GTUOtoS5xo6XZGP3FQk9H6VSVQoTFRe3I&#x22; target=&#x22;_blank&#x22; class=&#x22;button-6 w-button&#x22;>Listen</a>"},{"title":"Idaho Speaks","code":"<iframe width=&#x22;100%&#x22; height=&#x22;180&#x22; frameborder=&#x22;no&#x22; scrolling=&#x22;no&#x22; seamless=&#x22;&#x22; src=&#x22;https://share.transistor.fm/e/1d79191c&#x22;></iframe>"},{"title":"Introduction to David Worley (Video)","code":"<iframe src=&#x22;https://www.youtube.com/embed/y5bourwH7eQ?rel=0&amp;controls=1&amp;autoplay=0&amp;mute=0&amp;start=0&#x22; frameborder=&#x22;0&#x22; style=&#x22;position:absolute;left:0;top:0;width:100%;height:100%;pointer-events:auto&#x22; allow=&#x22;autoplay; encrypted-media&#x22; allowfullscreen=&#x22;&#x22; title=&#x22;Introduction to David Worley, candidate for Mayor of the City of Pocatello&#x22;></iframe>"},{"title":"Time to End the Tax-and-Spend Mentality (Video)","code":"<iframe src=&#x22;https://www.youtube.com/embed/rBi3slAvs6k?rel=0&amp;controls=1&amp;autoplay=0&amp;mute=0&amp;start=0&#x22; frameborder=&#x22;0&#x22; style=&#x22;position:absolute;left:0;top:0;width:100%;height:100%;pointer-events:auto&#x22; allow=&#x22;autoplay; encrypted-media&#x22; allowfullscreen=&#x22;&#x22; title=&#x22;Time to End the Tax-and-Spend Mentality&#x22;></iframe>"},{"title":"The Secret to Americas Greatness and the Purpose of Government (Video)","code":"<iframe src=&#x22;https://www.youtube.com/embed/k-QpccSz7Sc?rel=0&amp;controls=1&amp;autoplay=0&amp;mute=0&amp;start=0&#x22; frameborder=&#x22;0&#x22; style=&#x22;position:absolute;left:0;top:0;width:100%;height:100%;pointer-events:auto&#x22; allow=&#x22;autoplay; encrypted-media&#x22; allowfullscreen=&#x22;&#x22; title=&#x22;The Secret to Americas Greatness and the Purpose of Government&#x22;></iframe>"},{"title":"David Worley&#x27;s experience, background, and principles (Video)","code":"<iframe src=&#x22;https://www.youtube.com/embed/a48v1DYRBcs?rel=0&amp;controls=1&amp;autoplay=0&amp;mute=0&amp;start=0&#x22; frameborder=&#x22;0&#x22; style=&#x22;position:absolute;left:0;top:0;width:100%;height:100%;pointer-events:auto&#x22; allow=&#x22;autoplay; encrypted-media&#x22; allowfullscreen=&#x22;&#x22; title=&#x22;David Worley&#x27;s experience, background, and principles.&#x22;></iframe>"},{"title":"Economic Development that Matches Pocatello&#x27;s Values and Strengths (Video)","code":"<iframe src=&#x22;https://www.youtube.com/embed/y55EXrSo9Wg?rel=0&amp;controls=1&amp;autoplay=0&amp;mute=0&amp;start=0&#x22; frameborder=&#x22;0&#x22; style=&#x22;position:absolute;left:0;top:0;width:100%;height:100%;pointer-events:auto&#x22; allow=&#x22;autoplay; encrypted-media&#x22; allowfullscreen=&#x22;&#x22; title=&#x22;Economic Development that Matches Pocatello&#x27;s Values and Strengths&#x22;></iframe>"},{"title":"No More Mandates - EVERY Business is Essential (Video)","code":"<iframe src=&#x22;https://www.youtube.com/embed/O1X19i3n5A4?rel=0&amp;controls=1&amp;autoplay=0&amp;mute=0&amp;start=0&#x22; frameborder=&#x22;0&#x22; style=&#x22;position:absolute;left:0;top:0;width:100%;height:100%;pointer-events:auto&#x22; allow=&#x22;autoplay; encrypted-media&#x22; allowfullscreen=&#x22;&#x22; title=&#x22;No More Mandates - EVERY Business is Essential&#x22;></iframe>"}]}