words = {"home-1-h":"Vision","home-1-p":"Jake seeks to restore the balance of power between the Federal Government and states by reasserting Idaho’s powers as a sovereign state.  The founding generation of the American Republic gave the national government limited powers and gave the states broad authority.  This dynamic has been reversed and now the states are expected to obey every mandate and edict of Washington DC.  Now is the time to use state law and state resources to protect the God-given rights of our people from unconstitutional Federal overreach.","home-2-h":"Learn More","home-2-p":"Click here to learn more about Jake's platfom","platform-1-h":"Of The People, By The People, For The People","platform-1-p":"I believe first and foremost in accountability to the people of my district.  Representatives are elected, as the title implies, to represent the people's interests, not the interests of lobbyists, associations, and Political Action Committees.  If any of these types of organizations support my campaign, it will be because they support my principles, policies, and vision for Idaho.  I will not gain their support by promising to do their bidding in Boise.  I cannot be bought, blackmailed, or coerced.  I will serve the people of District 29 and support the United States and Idaho constitutions, even if it upsets special interest groups.  I will fight for our rights and freedom, regardless of the opposition.","platform-2-h":"Major Tax-And-Spend Reform","platform-2-p":"As a fiscal conservative, curbing wasteful spending of taxpayer money is one of my top priorities. I will not vote in favor of ANY new taxes or fees. I will be creative and resourceful in searching for opportunities to reduce taxpayer burden in every instance. Obviously, there are services that require public spending, such as police and education.  Government is most efficient when its size and scope is limited.  When government expands beyond its core functions it becomes wasteful and inefficient.  It is time to reign in the size and scope of Idaho government so we can provide tax relief to the people of our state.","platform-3-h":"ALL Businesses are Essential","platform-3-p":"From the Declaration of Independence: “We hold these truths to be self-evident, that all men are created equal, that they are endowed, by their Creator, with certain unalienable Rights, that among these are Life, Liberty, and the pursuit of Happiness.”Deeming any business “non-essential” is a direct violation of our God-given rights. Every business is essential because every job puts food on someone’s table.  It is unconstitutional and immoral for the government to deprive people of their right to provide for their families.  I will use every just and legal means available to ensure we never shut down Idaho businesses again.","platform-4-h":"Medical Freedom","platform-4-p":"Vaccination status should never be used as a condition of employment or occupational licensure.  No one should live in fear of losing their job based on a private medical decision.  Proof of vaccination should never be required to receive medical care, to participate in public events, or receive any good or service.  No vaccine passport system or anything like it should ever be implemented in Idaho, whether it comes from business or government.<br><br>Government and big business COVID-19 mitigation measures have failed to stop the virus.  However, they have reduced our freedom, radically expanded government power, and damaged our economy.  It is time for new legislation to end what COVID-19 restrictions remain and put new legal safeguards in place to ensure that the tyrannical restrictions of New York, California, and Washington DC never come to Idaho.","platform-5-h":"2nd Amendment Freedoms","platform-5-p":"The right to keep and bear arms is a God-given inalienable right enshrined in the US and Idaho constitutions.  The Second Amendment of the US Constitution clearly states “the right of the people to keep and bear arms <strong>shall not be infringed</strong>.”  Under no conditions will I ever vote to further infringe on our right to keep and own firearms.  I will fight for this right and will support any just and lawful means to protect Idaho from federal overreach and any attempt to curtail the Second Amendment.","platform-6-h":"Public Education","platform-6-p":"Cultural Marxism, specifically Critical Race theory, has made its way into Idaho classrooms. The “Woke” ideology of radical Left is being taught to varying degrees at every level of education, from elementary schools to college campuses.  Graphic and radical sexual education has no place in public schools.  Anti-American ideologies and teaching resources, such as the 1619 Project, that twist facts and lie to denigrate our history and turn our youth against their own country cannot be tolerated.<br><br>The best way to push back against this indoctrination of the youth is to allow for true school choice in Idaho.  It is time for parents to be given full power to choose how and where to have their children educated.  I believe that if parents are given the choice, they will make better decisions for their children than any bureaucrats in Washington DC, Boise, or any school district office.","platform-7-h":"Pro-Life","platform-7-p":"I am unequivocally and unapologetically Pro-Life. Science and morality do not take a backseat to convenience. I would ardently support legislation that would prohibit abortion in Idaho.","platform-8-h":"Jobs and Economic Growth","platform-8-p":"I will support fiscally conservative policies that reduce regulation and cost of doing business to encourage companies to operate in Idaho. Organizations who specialize in trades, manufacturing, industrial work, mining, and STEM areas bring high paying wages and encourage development of important and relevant skills. Idaho should be known as a state that welcomes these kinds of businesses.","about-1-p":"Jake attended High School in Eagle ID, graduating in 2009. He moved to Pocatello in 2010, to study at ISU where he earned a Bachelor of Business Administration in Computer Information Systems.<br><br>Shortly after graduating college, Jake was married to his wife Jordan and they started a family. They now have 2 sons ages 5 and 3.<br><br>Jake joined the Army Reserve in 2010 and served as an enlisted soldier and Non-Commissioned Officer until he was selected to become a Warrant Officer.  He was appointed in 2020 after completing United States Army Warrant Officer Candidate School.<br><br>Jake works for a crop science company and specializes in industrial cybersecurity and IT project management.","donate-1-p":"Donate today to support Jake Stevens for Idaho!","donate-2-p":"Donations can also be made via Venmo:<br>@jakeforidaho","donate-3-p":"The maximum an individual can contribute is $1,000. If you contribute more than $50 via Venmo, please send your name and address to <a href=\"mailto:jake@jakeforidaho.com\">jake@jakeforidaho.com</a> for reporting purposes.","compare-1-h":"YES","compare-2-h":"Protect the lives of unborn children","compare-3-h":"(Idaho House Bill 366)","compare-4-h":"NO","compare-5-h":"YES","compare-6-h":"Ban racist indoctrination from public schools","compare-7-h":"(Idaho House Bill 377)","compare-8-h":"NO","compare-9-h":"YES","compare-10-h":"Ban men from competing in girls' sports","compare-11-h":"(Idaho House Bill 500)","compare-12-h":"NO","compare-13-h":"YES","compare-14-h":"Fight against forced business shutdowns","compare-15-h":"(Idaho House Bill 135)","compare-16-h":"NO","compare-17-h":"YES","compare-18-h":"Fight against vaccine mandates","compare-19-h":"(Idaho House Bill 415)","compare-20-h":"NO","compare-21-h":"","compare-22-h":"","compare-23-h":"","compare-24-h":"","compare-25-h":"","compare-26-h":"","compare-27-h":"","compare-28-h":"","compare-29-h":"","compare-30-h":"","compare-31-h":"","compare-32-h":"","compare-33-h":"","compare-34-h":"","compare-35-h":"","compare-36-h":""}
